def area(a,b):
    '''
    Вычисляет площадь прямоугольника.

    Параметры:
        a (float): Длина первой стороны.
        b (float): Длина второй стороны.

    Возвращает:
        float: Площадь прямоугольника.

    '''
    return a * b


def perimeter(a,b):
    '''
    Вычисляет периметр прямоугольника.

    Параметры:
        a (float): Длина первой стороны (неотрицательная).
        b (float): Длина второй стороны (неотрицательная).

    Возвращает:
        float: Периметр прямоугольника.
    '''
    return 2 * (a + b)
